public/2015/12/02/Python_Connect_MySQL.html

        <!DOCTYPE HTML>
        <html>
        <head>
        <meta charset="utf-8">
        
        <title>StudyNotes</title>
        <meta name="author" content="FangQian">
        <meta name="description" content="Use OrgNote.">
        <meta property="og:site_name" content="StudyNotes"/>
        <meta name="Keywords" content="OrgNote,Emacs,org-mode,blog,python,geek">
        
        <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
        <meta property="og:image" content="undefined"/>

        <link href="/favicon.ico" rel="icon">
        
        <link rel="stylesheet" href="/theme/freemind/css/bootstrap.min.css" media="screen" type="text/css">
        <link rel="stylesheet" href="/theme/freemind/css/font-awesome.css" media="screen" type="text/css">
        <link rel="stylesheet" href="/theme/freemind/css/style.css" media="screen" type="text/css">
        <link rel="stylesheet" href="/theme/freemind/css/highlight.css" media="screen" type="text/css">
        <link rel="stylesheet" href="/theme/freemind/css/default-highlight.css" media="screen" type="text/css">
        </head>
        

        <body>  
        <nav id="main-nav" class="navbar navbar-inverse navbar-fixed-top" role="navigation">
        
        <div class="container">
        
        <button type="button" class="navbar-header navbar-toggle" data-toggle="collapse" data-target=".navbar-collapse">
        <span class="sr-only">Toggle navigation</span>
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>
        </button>
    
        <a class="navbar-brand" href="/index.html">StudyNotes</a>
        

        <div class="collapse navbar-collapse nav-menu">
        
        <ul class="nav navbar-nav">
        <li><a href="/public/minyi.html" title="归档"><i class="fa fa-sitemap"></i>MinYi</a></li><li><a href="/public/archive.html" title="归档"><i class="fa fa-archive"></i>归档</a></li><li><a href="/public/about.html" title="关于"><i class="fa fa-user"></i>关于</a></li>
        </ul>
        
        </div> <!-- navbar -->
        </div> <!-- container -->
        </nav>
        

        <div class="clearfix"></div>
        <div class="container">
        <div class="content">
        
        <div class="page-header">                   <!-- page-header begin -->
        <h1>MySQL 数据库的连接</h1>
        </div>                                      <!-- page-header end -->
        
        <div class="row page">                      <!-- row-page begin -->
        <div class="col-md-9">                      <!-- col-md-9 begin -->
        <div class="mypage">                        <!-- mypage begin -->
        
        <div class="slogan">                        <!-- slogan begin -->
        <i class="fa fa-heart"></i>
        标签: <a href="/public/tags/Python.html"><i class="Python"></i>Python</a>
        </div>                                     <!-- slogan end -->
        
<div id="content">

<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 安装MySQL-python</a></li>
<li><a href="#sec-2">2. 连接</a>
<ul>
<li><a href="#sec-2-1">2.1. 使用MySQLdb连接MySQL的函数为connect()。声明如下:</a></li>
<li><a href="#sec-2-2">2.2. 创建连接对象：</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 数据操作</a>
<ul>
<li><a href="#sec-3-1">3.1. 获取cursor游标对象</a></li>
<li><a href="#sec-3-2">3.2. 数据操作</a></li>
<li><a href="#sec-3-3">3.3. 关闭连接</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="outline-2" id="outline-container-sec-1">
<h2 id="sec-1"><span class="section-number-2">1</span> 安装MySQL-python</h2>
<div class="outline-text-2" id="text-1">
<p>
MySQL db 是Python连接MySQL的模块。
测试：
使用之前首先要确定Python环境里有没有这个库，打开Python shell,输入：
</p>
<pre class="example">
import MySQLdb
</pre>
<p>
如果返回错误信息，就表示还没有安装这个模块。需要下载安装。
下载地址：<a href="https://pypi.python.org/pypi/MySQL-python/">https://pypi.python.org/pypi/MySQL-python/</a>
下载压缩文件之后直接解压，进入解压文件夹：
$ python setup.py install
</p>
</div>
</div>
<div class="outline-2" id="outline-container-sec-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 连接</h2>
<div class="outline-text-2" id="text-2">
</div><div class="outline-3" id="outline-container-sec-2-1">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 使用MySQLdb连接MySQL的函数为connect()。声明如下:</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="example">
connect (parameters...)
</pre>
<p>
常用参数如下：
</p>
<ul class="org-ul">
<li>host: MySQL 主机名或者IP地址。本地的为localhost/127.0.0.1
</li>
<li>user: 连接使用的用户名。本地的为root。
</li>
<li>password: 连接使用的用户名的密码。
</li>
<li>dbname: 默认打开的数据库。
</li>
<li>port: MySQL 服务端口。MySQL服务端口的TCP端口，默认是3306。
</li>
</ul>
<p>
如果连接成功返回一个连接对象。若输入的数据库信息不对，连接失败，会触发
OperationalError,返回错误信息。
</p>
</div>
</div>
<div class="outline-3" id="outline-container-sec-2-2">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 创建连接对象：</h3>
<div class="outline-text-3" id="text-2-2">
<pre class="example">
import MySQLdb
conn = MySQLdb.Connection('host','user','password',dbname)
</pre>
<p>
这个连接对象也提供了对事物操作的支持，标准的方法如下：
</p>
<ul class="org-ul">
<li>提交：commit()
</li>
<li>回滚：rollback()
</li>
</ul>
</div>
</div>
</div>
<div class="outline-2" id="outline-container-sec-3">
<h2 id="sec-3"><span class="section-number-2">3</span> 数据操作</h2>
<div class="outline-text-2" id="text-3">
</div><div class="outline-3" id="outline-container-sec-3-1">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 获取cursor游标对象</h3>
<div class="outline-text-3" id="text-3-1">
<p>
数据操作包括查询(select),插入(insert),更新(update),删除(delete)等。由于MySQLdb模块
底层其实是调用C API的，所以,需要先得到当前所指向数据库的指针(游标对象):
</p>
<pre class="example">
cur =conn.cursor()
</pre>
</div>
</div>
<div class="outline-3" id="outline-container-sec-3-2">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 数据操作</h3>
<div class="outline-text-3" id="text-3-2">
<p>
现在可以使用cursor对象的execute()执行SQL语句进行数据操作了。例如：
</p>
<div class="source"><pre><span></span><span class="err">＃创建数据表</span>
<span class="n">cur</span><span class="o">.</span><span class="n">execute</span><span class="p">(</span><span class="s2">&quot;create table student(id int,name varchar(20))&quot;</span><span class="p">)</span>

<span class="c1"># 获取表中有多少条数据</span>
<span class="n">cur</span><span class="o">.</span><span class="n">execute</span><span class="p">(</span><span class="s1">&#39;select * from tables&#39;</span><span class="p">)</span>

<span class="c1">#插入一条数据</span>
<span class="n">cur</span><span class="o">.</span><span class="n">execute</span><span class="p">(</span><span class="s2">&quot;insect into student (&#39;2&#39;,&#39;Tom&#39;)...&quot;</span><span class="p">)</span>

<span class="err">＃修改　满足查询条件的数据</span>
<span class="n">cur</span><span class="o">.</span><span class="n">execute</span><span class="p">(</span><span class="s2">&quot;update student set id = &#39;3&#39; where name = &#39;Tom&#39;&quot;</span><span class="p">)</span>

<span class="c1">#删除　满足查询条件的数据</span>
<span class="n">cur</span><span class="o">.</span><span class="n">execute</span><span class="p">(</span><span class="s2">&quot;delete from student where id = &#39;3&#39;&quot;</span><span class="p">)</span>
</pre></div>

<p>
查询数据的操作并没有把表中的数据打印出来，只得到了表中数据的行数。fetchone()
方法可以帮助我们获得表中的数据，可是每次执行cur.fetchone() 获得的数据都不一样，换句话说我每执行一次，
游标会从表中的第一条数据移动到下一条数据的位置，所以，我再次执行的时候得到的是第二条数据。
scroll(0,'absolute')方法可以将游标定位到表中的第一条数据。
</p>
<ul class="org-ul">
<li>打印表中的数据
</li>
</ul>
<p>
fetchmany()方法可以获得多条数据，但需要指定数据的条数，通过
一个for循环就可以把多条数据打印出啦！
</p>
<div class="source"><pre><span></span><span class="n">aa</span> <span class="o">=</span> <span class="n">cur</span><span class="o">.</span><span class="n">execute</span><span class="p">(</span><span class="s2">&quot;select * from student&quot;</span><span class="p">)</span>
<span class="n">info</span> <span class="o">=</span> <span class="n">cur</span><span class="o">.</span><span class="n">fetchmany</span><span class="p">(</span><span class="n">aa</span><span class="p">)</span>
<span class="k">for</span> <span class="n">ii</span> <span class="ow">in</span> <span class="n">info</span><span class="p">:</span>
    <span class="k">print</span> <span class="n">ii</span>
</pre></div>

<ul class="org-ul">
<li>注意
</li>
</ul>
<p>
在执行完插入或修改或删除操作后，需要调用一下conn.commit()方法
进行提交，否则操作不会生效，即数据不会被真的插入。
</p>
</div>
</div>
<div class="outline-3" id="outline-container-sec-3-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 关闭连接</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>关闭操作分两步，需要分表地关闭指针对象cursor和连接对象connection
</li>
</ul>
<pre class="example">
cur.close()
connection.close()
</pre>
</div>
</div>
</div>
</div>
            <div>
            <center>
            <div class="pagination">
            <ul class="pagination">
            <li class="prev"><a href="/public/2015/12/02/MySQL.html" class=alignright prev"><i class="fa fa-arrow-circle-o-left"></i>上一页</a></li>
            <li><a href="/public/archive.html" target="_blank"><i class="fa fa-archive"></i>Archive</a></li>
            <li class="next"><a href="/public/2015/11/14/pythonbase.html" class="alignright next">下一页<i class="fa fa-arrow-circle-o-right"></i></a></li>
            </ul>
            </div>
            </center>
            </div>
            
            </div> <!-- my-page --></div> <!-- col-md -->

        <div class="col-md-3">
        <div id="sidebar">
        
        <div class="widget">
        <h4>最新文章</h4>
        <ul class="entry list-unstyled">
        <li><a href="/public/2016/02/29/redis.html"><i class="fa fa-file-o"></i>Redis基础</a></li><li><a href="/public/2016/02/24/WTForms.html"><i class="fa fa-file-o"></i>WTForms</a></li><li><a href="/public/2016/02/02/easy_install.html"><i class="fa fa-file-o"></i>easy_install</a></li><li><a href="/public/2015/11/14/pythonbase.html"><i class="fa fa-file-o"></i>Python基础知识</a></li><li><a href="/public/2015/11/13/simplecommand.html"><i class="fa fa-file-o"></i>简单的Linux命令</a></li><li><a href="/public/2015/12/11/git.html"><i class="fa fa-file-o"></i>常用git命令清单</a></li>
        </ul>   
        </div> 
        
        <div class="widget">
        <h4>标签云</h4>
        <ul class="tag_box inline list-unstyled">
        <li><a href="/public/tags/Redis.html">Redis<span>1</span></a></li><li><a href="/public/tags/Flask.html">Flask<span>1</span></a></li><li><a href="/public/tags/python.html">python<span>1</span></a></li><li><a href="/public/tags/Python.html">Python<span>3</span></a></li><li><a href="/public/tags/Linux.html">Linux<span>5</span></a></li><li><a href="/public/tags/HTML&CSS.html">HTML&CSS<span>1</span></a></li><li><a href="/public/tags/ShellScript.html">ShellScript<span>2</span></a></li><li><a href="/public/tags/MySQL.html">MySQL<span>2</span></a></li><li><a href="/public/tags/随笔.html">随笔<span>1</span></a></li>
        </ul>
        </div>
        
        <div class="widget">
        <h4>时间机器</h4>
        <ul class="tag_box inline list-unstyled">
        <li><a href="/public/tags/201602.html">201602<span>3</span></a></li><li><a href="/public/tags/201512.html">201512<span>6</span></a></li><li><a href="/public/tags/201511.html">201511<span>6</span></a></li><li><a href="/public/tags/201412.html">201412<span>1</span></a></li><li><a href="/public/tags/201411.html">201411<span>1</span></a></li><li><a href="/public/archive.html">All<span>17</span></a></li>
        </ul>
        </div>
        
        <div class="widget">
        <h4>快速链接</h4>
        <ul class="entry list-unstyled">
        
            <li><a href="http://lesliezhu.github.com" title="Leslie Zhu" target="_blank"><i class="fa fa-github"></i>Leslie Zhu</a></li>
            
            <li><a href="https://github.com/LeslieZhu/OrgNote" title="OrgNote" target="_blank"><i class="fa fa-github"></i>OrgNote</a></li>
            
            <li><a href="http://code.activestate.com/recipes/langs/python" title="Python-Cookbook" target="_blank"><i class="fa fa-github"></i>Python-Cookbook</a></li>
            
        </ul>
        </div>
        
        </div> <!-- sidebar -->
        </div> <!-- col-md-3 -->
        

        </div> <!-- row-fluid -->
        </div>
        </div>
        

        <div class="container-narrow">
        <footer>
        <p>&copy; 2014 FangQian
        with help from <a href="https://github.com/LeslieZhu/OrgNote" target="_blank">OrgNote</a>. Theme by <a href="https://github.com/LeslieZhu/orgnote-theme-freemind">orgnote-theme-freemind</a>.  Published with GitHub Pages. 
        </p> </footer>
        </div> <!-- container-narrow -->
        
        <a id="gotop" href="#">   
        <span>▲</span> 
        </a>
        
        </body>
        </html>
        
